ams/src/Documents/ПересчетТоваров/ПересчетТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПересчетТоваров</name>
  <registerRecords>AccumulationRegister.ТоварныеМестаКОтражениюИзлишковНедостач</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</registerRecords>
  <registerRecords>InformationRegister.БлокировкиСкладскихЯчеек</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВЯчейках</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПересчета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПересчетовТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьКоличествоПоУчету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетныеДанныеЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаКонсолидацииИзлишковТоваров</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаКонсолидацииИспорченныхТоваров</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтдельнуюЯчейкуИзлишков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтдельнуюЯчейкуПорчи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьЯчейки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзлишекПорча</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтролируемаяПартия</name>
      <type>
        <types>CatalogRef.КонтролируемыеПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодтвержденияКачества</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодлежитРазблокировке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Documents/ПересчетТоваров/Forms/AMS_ВнесениеРезультатов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПересчетовТоваров.ВнесениеРезультатов") Тогда
		Элементы.КолФакт.ТолькоПросмотр = Истина;;
		Элементы.КолФакт.ЦветФона       = ЦветаСтиля.ЦветФонаШапкиОтчета;
		
		Элементы.КолУпакФакт.ТолькоПросмотр = Истина;
		Элементы.КолУпакФакт.ЦветФона       = ЦветаСтиля.ЦветФонаШапкиОтчета;
	КонецЕсли;		
	
	Табл = Параметры.Товары;
	
	Для Каждого Стр Из Табл Цикл
		НовСтр = Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
		Кфц = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовСтр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
		Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовСтр.Номенклатура, "_Упаковка");
		
		НовСтр.Упаковка = Упаковка;
		
		НовСтр.КолУпакПоУчету = НовСтр.Количество / Кфц;
		
		НовСтр.КолУпакФакт = Цел(НовСтр.КоличествоФакт / Кфц);
		НовСтр.КолФакт     = НовСтр.КоличествоФакт - НовСтр.КолУпакФакт * Кфц;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура КолФактПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтроку(Стр);
КонецПроцедуры

&НаКлиенте
Процедура КолУпакФактПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтроку(Стр);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Модифицированность = Ложь;

	Данные = ПолучитьМассивСтрок();

	Закрыть(Данные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьСтроку(Стр)
	Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");

	Стр.КоличествоФакт         = Стр.КолУпакФакт * Кфц + Стр.КолФакт;
	Стр.КоличествоУпаковокФакт = Стр.КоличествоФакт;

	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтрок()
	МассивСтрок = Новый Массив;
	
	Табл = Товары.Выгрузить();
	
	Для Каждого Стр Из Табл Цикл
		МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

#КонецОбласти
